{"keras_version": "2.0.3", "config": [{"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "padding": "valid", "name": "conv2d_1", "dtype": "float32", "kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 32, "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "conv2d_2", "trainable": true, "kernel_size": [3, 3], "filters": 64, "activation": "relu", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "units": 128, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "units": 10, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_2", "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}