{"keras_version": "2.0.3", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [2, 2], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "filters": 32, "name": "conv2d_1"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "filters": 32, "name": "conv2d_2"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_3"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [3, 3], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "filters": 80, "name": "conv2d_4"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "filters": 192, "name": "conv2d_5"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [3, 3], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_9"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 48, "name": "conv2d_7"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 96, "name": "conv2d_10"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "average_pooling2d_1", "pool_size": [3, 3], "padding": "same", "trainable": true}, "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_6"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [5, 5], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_8"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 96, "name": "conv2d_11"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 32, "name": "conv2d_12"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11", "config": {"activation": "relu", "name": "activation_11", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "config": {"activation": "relu", "name": "activation_12", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "name": "mixed0", "config": {"name": "mixed0", "axis": 3, "trainable": true}, "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_16", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_16"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "config": {"activation": "relu", "name": "activation_16", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_14", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 48, "name": "conv2d_14"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 96, "name": "conv2d_17"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "config": {"activation": "relu", "name": "activation_14", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "activation_17", "config": {"activation": "relu", "name": "activation_17", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "average_pooling2d_2", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "average_pooling2d_2", "pool_size": [3, 3], "padding": "same", "trainable": true}, "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_13", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_13"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [5, 5], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_15"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 96, "name": "conv2d_18"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_19", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_19"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_19", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_13", "config": {"activation": "relu", "name": "activation_13", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "activation_15", "config": {"activation": "relu", "name": "activation_15", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18", "config": {"activation": "relu", "name": "activation_18", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "activation_19", "config": {"activation": "relu", "name": "activation_19", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]], "name": "mixed1", "config": {"name": "mixed1", "axis": 3, "trainable": true}, "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_23", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_23"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_23", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "activation_23", "config": {"activation": "relu", "name": "activation_23", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_21", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 48, "name": "conv2d_21"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 96, "name": "conv2d_24"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_21", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_24", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "activation_21", "config": {"activation": "relu", "name": "activation_21", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "activation_24", "config": {"activation": "relu", "name": "activation_24", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "average_pooling2d_3", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "average_pooling2d_3", "pool_size": [3, 3], "padding": "same", "trainable": true}, "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_20", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_20"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_22", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [5, 5], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_22"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_25", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 96, "name": "conv2d_25"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "conv2d_26", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_26"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_20", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_22", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_25", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_26", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20", "config": {"activation": "relu", "name": "activation_20", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22", "config": {"activation": "relu", "name": "activation_22", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "name": "activation_25", "config": {"activation": "relu", "name": "activation_25", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "activation_26", "config": {"activation": "relu", "name": "activation_26", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]], "name": "mixed2", "config": {"name": "mixed2", "axis": 3, "trainable": true}, "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_28", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 64, "name": "conv2d_28"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_28", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "activation_28", "config": {"activation": "relu", "name": "activation_28", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_29", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 96, "name": "conv2d_29"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_29", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "activation_29", "config": {"activation": "relu", "name": "activation_29", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_27", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [2, 2], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "filters": 384, "name": "conv2d_27"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "conv2d_30", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [2, 2], "data_format": "channels_last", "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "filters": 96, "name": "conv2d_30"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_27", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_30", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "name": "activation_27", "config": {"activation": "relu", "name": "activation_27", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "name": "activation_30", "config": {"activation": "relu", "name": "activation_30", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [3, 3], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "name": "mixed3", "config": {"name": "mixed3", "axis": 3, "trainable": true}, "class_name": "Concatenate"}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_35", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 128, "name": "conv2d_35"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "name": "batch_normalization_35", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_35", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]], "name": "activation_35", "config": {"activation": "relu", "name": "activation_35", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_35", 0, 0, {}]]], "name": "conv2d_36", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": false, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [7, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "same", "filters": 128, "name": "conv2d_36"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "name": "batch_normalization_36", "config": {"beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "trainable": true, "beta_constraint": null, "name": "batch_normalization_36", "beta_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]], "name": "activation_36", "config": {"activation": "relu", "name": "activation_36", "trainable": true}, "class_name": "Activation"}, {"inbound_nodes": [[["mixed3", 0, 0, {}]]], "name": "conv2d_32", "config": {"bias_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], 